{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_filter": 24, "bias": true, "W_regularizer": null, "activation": "relu", "input_dtype": "float32", "nb_col": 4, "activity_regularizer": null, "dim_ordering": "tf", "batch_input_shape": [null, 40, 160, 3], "init": "glorot_uniform", "b_regularizer": null, "nb_row": 4, "subsample": [2, 2], "W_constraint": null, "border_mode": "valid", "trainable": true, "name": "convolution2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.3, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_filter": 36, "bias": true, "W_regularizer": null, "activation": "relu", "nb_col": 4, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 4, "subsample": [2, 2], "trainable": true, "border_mode": "valid", "W_constraint": null, "name": "convolution2d_2"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_filter": 48, "bias": true, "W_regularizer": null, "activation": "relu", "nb_col": 4, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 4, "subsample": [2, 2], "trainable": true, "border_mode": "valid", "W_constraint": null, "name": "convolution2d_3"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_filter": 64, "bias": true, "W_regularizer": null, "activation": "relu", "nb_col": 2, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 2, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "W_constraint": null, "name": "convolution2d_4"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_filter": 64, "bias": true, "W_regularizer": null, "activation": "relu", "nb_col": 2, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 2, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "W_constraint": null, "name": "convolution2d_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "relu", "input_dim": null, "activity_regularizer": null, "output_dim": 100, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "trainable": true, "name": "dense_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "relu", "input_dim": null, "activity_regularizer": null, "output_dim": 50, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "trainable": true, "name": "dense_2"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "relu", "input_dim": null, "activity_regularizer": null, "output_dim": 10, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "trainable": true, "name": "dense_3"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "tanh", "input_dim": null, "activity_regularizer": null, "output_dim": 1, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "trainable": true, "name": "dense_4"}}], "keras_version": "1.1.2"}