{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"mode": 0, "trainable": true, "epsilon": 0.001, "name": "batchnormalization_1", "input_dtype": "float32", "axis": -1, "batch_input_shape": [null, 40, 160, 3], "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 4, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "nb_row": 4, "b_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "trainable": true, "name": "convolution2d_1", "W_constraint": null, "bias": true, "border_mode": "valid", "nb_filter": 24, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_col": 4, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "nb_row": 4, "b_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "trainable": true, "name": "convolution2d_2", "W_constraint": null, "bias": true, "border_mode": "valid", "nb_filter": 36, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_col": 2, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "nb_row": 2, "b_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "trainable": true, "name": "convolution2d_3", "W_constraint": null, "bias": true, "border_mode": "valid", "nb_filter": 64, "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "output_dim": 50, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "name": "dense_1", "W_constraint": null, "input_dim": null, "bias": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.4}}, {"class_name": "Dense", "config": {"activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "output_dim": 10, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "name": "dense_2", "W_constraint": null, "input_dim": null, "bias": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"activation": "tanh", "init": "glorot_uniform", "W_regularizer": null, "output_dim": 1, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "name": "dense_3", "W_constraint": null, "input_dim": null, "bias": true, "b_constraint": null}}]}