{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"mode": 0, "epsilon": 0.001, "momentum": 0.99, "batch_input_shape": [null, 40, 160, 3], "gamma_regularizer": null, "name": "batchnormalization_1", "input_dtype": "float32", "axis": -1, "beta_regularizer": null, "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "bias": true, "activation": "relu", "nb_col": 4, "nb_filter": 24, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_1", "subsample": [2, 2], "nb_row": 4, "trainable": true, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "bias": true, "activation": "relu", "nb_col": 4, "nb_filter": 36, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_2", "subsample": [2, 2], "nb_row": 4, "trainable": true, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "bias": true, "activation": "relu", "nb_col": 4, "nb_filter": 48, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_3", "subsample": [2, 2], "nb_row": 4, "trainable": true, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "bias": true, "activation": "relu", "nb_col": 2, "nb_filter": 64, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_4", "subsample": [1, 1], "nb_row": 2, "trainable": true, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "bias": true, "activation": "relu", "nb_col": 2, "nb_filter": 64, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_5", "subsample": [1, 1], "nb_row": 2, "trainable": true, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "W_constraint": null, "bias": true, "output_dim": 100, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "b_constraint": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.4, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "W_constraint": null, "bias": true, "output_dim": 50, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "b_constraint": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "W_constraint": null, "bias": true, "output_dim": 10, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "b_constraint": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "W_constraint": null, "bias": true, "output_dim": 1, "activation": "tanh", "b_regularizer": null, "init": "glorot_uniform", "name": "dense_4", "b_constraint": null, "trainable": true, "W_regularizer": null}}]}