{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 80, 320, 3], "beta_regularizer": null, "name": "batchnormalization_1", "mode": 0, "epsilon": 0.001, "axis": -1}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "bias": true, "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_1", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_col": 5, "trainable": true, "border_mode": "valid", "b_constraint": null, "nb_row": 5, "activity_regularizer": null, "nb_filter": 24}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "bias": true, "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_2", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_col": 5, "trainable": true, "border_mode": "valid", "b_constraint": null, "nb_row": 5, "activity_regularizer": null, "nb_filter": 36}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "bias": true, "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_3", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_col": 5, "trainable": true, "border_mode": "valid", "b_constraint": null, "nb_row": 5, "activity_regularizer": null, "nb_filter": 48}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_4", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_col": 3, "trainable": true, "border_mode": "valid", "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 64}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_5", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_col": 3, "trainable": true, "border_mode": "valid", "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "nb_filter": 64}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "input_dim": null, "output_dim": 100, "name": "dense_1", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "input_dim": null, "output_dim": 50, "name": "dense_2", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "input_dim": null, "output_dim": 10, "name": "dense_3", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "input_dim": null, "output_dim": 1, "name": "dense_4", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "activity_regularizer": null}}]}