{"config": [{"config": {"beta_regularizer": null, "momentum": 0.99, "input_dtype": "float32", "trainable": true, "mode": 0, "batch_input_shape": [null, 160, 320, 3], "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "name": "batchnormalization_1"}, "class_name": "BatchNormalization"}, {"config": {"init": "glorot_uniform", "subsample": [2, 2], "activation": "linear", "nb_col": 5, "b_constraint": null, "nb_filter": 24, "border_mode": "valid", "name": "convolution2d_1", "trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "nb_row": 5, "W_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "subsample": [2, 2], "activation": "linear", "nb_col": 5, "b_constraint": null, "nb_filter": 36, "border_mode": "valid", "name": "convolution2d_2", "trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "nb_row": 5, "W_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "subsample": [2, 2], "activation": "linear", "nb_col": 5, "b_constraint": null, "nb_filter": 48, "border_mode": "valid", "name": "convolution2d_3", "trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "nb_row": 5, "W_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "subsample": [1, 1], "activation": "linear", "nb_col": 3, "b_constraint": null, "nb_filter": 64, "border_mode": "valid", "name": "convolution2d_4", "trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "nb_row": 3, "W_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "subsample": [1, 1], "activation": "linear", "nb_col": 3, "b_constraint": null, "nb_filter": 64, "border_mode": "valid", "name": "convolution2d_5", "trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "nb_row": 3, "W_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "activation": "linear", "b_constraint": null, "output_dim": 100, "activity_regularizer": null, "name": "dense_1", "trainable": true, "bias": true, "W_constraint": null, "input_dim": null, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "activation": "linear", "b_constraint": null, "output_dim": 50, "activity_regularizer": null, "name": "dense_2", "trainable": true, "bias": true, "W_constraint": null, "input_dim": null, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "activation": "linear", "b_constraint": null, "output_dim": 10, "activity_regularizer": null, "name": "dense_3", "trainable": true, "bias": true, "W_constraint": null, "input_dim": null, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "activation": "linear", "b_constraint": null, "output_dim": 1, "activity_regularizer": null, "name": "dense_4", "trainable": true, "bias": true, "W_constraint": null, "input_dim": null, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}