{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "beta_regularizer": null, "input_dtype": "float32", "epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "name": "batchnormalization_1", "batch_input_shape": [null, 40, 160, 3], "axis": -1}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "activation": "relu", "b_constraint": null, "activity_regularizer": null, "nb_filter": 24, "trainable": true, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 4, "b_regularizer": null, "bias": true, "name": "convolution2d_1", "nb_col": 4, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "activation": "relu", "b_constraint": null, "activity_regularizer": null, "nb_filter": 36, "trainable": true, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 4, "b_regularizer": null, "bias": true, "name": "convolution2d_2", "nb_col": 4, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "activation": "relu", "b_constraint": null, "activity_regularizer": null, "nb_filter": 48, "trainable": true, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 4, "b_regularizer": null, "bias": true, "name": "convolution2d_3", "nb_col": 4, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "activation": "relu", "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "trainable": true, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 2, "b_regularizer": null, "bias": true, "name": "convolution2d_4", "nb_col": 2, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "activation": "relu", "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "trainable": true, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 2, "b_regularizer": null, "bias": true, "name": "convolution2d_5", "nb_col": 2, "subsample": [1, 1]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "activation": "relu", "output_dim": 100, "activity_regularizer": null, "name": "dense_1", "trainable": true, "bias": true, "init": "glorot_uniform", "input_dim": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.4, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "activation": "relu", "output_dim": 50, "activity_regularizer": null, "name": "dense_2", "trainable": true, "bias": true, "init": "glorot_uniform", "input_dim": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "activation": "relu", "output_dim": 10, "activity_regularizer": null, "name": "dense_3", "trainable": true, "bias": true, "init": "glorot_uniform", "input_dim": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "activation": "tanh", "output_dim": 1, "activity_regularizer": null, "name": "dense_4", "trainable": true, "bias": true, "init": "glorot_uniform", "input_dim": null, "b_constraint": null, "b_regularizer": null}}]}