{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "BatchNormalization", "config": {"mode": 0, "batch_input_shape": [null, 40, 160, 3], "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_1", "axis": -1, "trainable": true, "input_dtype": "float32", "momentum": 0.99}}, {"class_name": "Convolution2D", "config": {"bias": true, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "name": "convolution2d_1", "activity_regularizer": null, "b_constraint": null, "subsample": [2, 2], "b_regularizer": null, "nb_row": 4, "W_constraint": null, "activation": "relu", "nb_col": 4, "nb_filter": 24, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"bias": true, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "name": "convolution2d_2", "activity_regularizer": null, "b_constraint": null, "subsample": [2, 2], "b_regularizer": null, "nb_row": 4, "W_constraint": null, "activation": "relu", "nb_col": 4, "nb_filter": 36, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"bias": true, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "name": "convolution2d_3", "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "b_regularizer": null, "nb_row": 2, "W_constraint": null, "activation": "relu", "nb_col": 2, "nb_filter": 64, "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "trainable": true, "name": "dense_1", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "relu", "output_dim": 50, "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "trainable": true, "name": "dense_2", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "relu", "output_dim": 10, "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "trainable": true, "name": "dense_3", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "tanh", "output_dim": 1, "init": "glorot_uniform", "input_dim": null}}]}