{"keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "batch_input_shape": [null, 40, 160, 3], "border_mode": "valid", "nb_filter": 24, "init": "glorot_uniform", "nb_row": 4, "bias": true, "name": "convolution2d_1", "nb_col": 4, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "input_dtype": "float32", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "nb_filter": 36, "init": "glorot_uniform", "nb_row": 4, "bias": true, "name": "convolution2d_2", "nb_col": 4, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "nb_filter": 48, "init": "glorot_uniform", "nb_row": 4, "bias": true, "name": "convolution2d_3", "nb_col": 4, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "nb_filter": 64, "init": "glorot_uniform", "nb_row": 2, "bias": true, "name": "convolution2d_4", "nb_col": 2, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "nb_filter": 64, "init": "glorot_uniform", "nb_row": 2, "bias": true, "name": "convolution2d_5", "nb_col": 2, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "W_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "name": "dense_1", "bias": true, "trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "input_dim": null, "output_dim": 100}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "name": "dense_2", "bias": true, "trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "input_dim": null, "output_dim": 50}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "name": "dense_3", "bias": true, "trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "input_dim": null, "output_dim": 10}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "name": "dense_4", "bias": true, "trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "activation": "tanh", "input_dim": null, "output_dim": 1}}], "class_name": "Sequential"}