{"config": [{"config": {"trainable": true, "mode": 0, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "input_dtype": "float32", "name": "batchnormalization_1", "axis": -1, "batch_input_shape": [null, 40, 160, 1], "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "nb_row": 4, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "nb_col": 4, "activity_regularizer": null, "name": "convolution2d_1", "nb_filter": 24, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "nb_row": 4, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "nb_col": 4, "activity_regularizer": null, "name": "convolution2d_2", "nb_filter": 36, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "nb_row": 4, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "nb_col": 4, "activity_regularizer": null, "name": "convolution2d_3", "nb_filter": 48, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "nb_row": 2, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "nb_col": 2, "activity_regularizer": null, "name": "convolution2d_4", "nb_filter": 64, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "nb_row": 2, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "nb_col": 2, "activity_regularizer": null, "name": "convolution2d_5", "nb_filter": 64, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "activation": "relu", "input_dim": null, "W_constraint": null, "W_regularizer": null, "output_dim": 100, "b_constraint": null, "name": "dense_1", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "input_dim": null, "W_constraint": null, "W_regularizer": null, "output_dim": 50, "b_constraint": null, "name": "dense_2", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "input_dim": null, "W_constraint": null, "W_regularizer": null, "output_dim": 10, "b_constraint": null, "name": "dense_3", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "tanh", "input_dim": null, "W_constraint": null, "W_regularizer": null, "output_dim": 1, "b_constraint": null, "name": "dense_4", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}