{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "input_dtype": "float32", "name": "batchnormalization_1", "batch_input_shape": [null, 80, 320, 3], "mode": 0, "epsilon": 0.001, "axis": -1}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "trainable": true, "nb_row": 5, "nb_filter": 24, "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "bias": true, "activity_regularizer": null, "subsample": [2, 2], "name": "convolution2d_1", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "nb_col": 5, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "trainable": true, "nb_row": 5, "nb_filter": 36, "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "bias": true, "activity_regularizer": null, "subsample": [2, 2], "name": "convolution2d_2", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "nb_col": 5, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "trainable": true, "nb_row": 5, "nb_filter": 48, "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "bias": true, "activity_regularizer": null, "subsample": [2, 2], "name": "convolution2d_3", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "nb_col": 5, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "trainable": true, "nb_row": 3, "nb_filter": 64, "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "bias": true, "activity_regularizer": null, "subsample": [1, 1], "name": "convolution2d_4", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "nb_col": 3, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "trainable": true, "nb_row": 3, "nb_filter": 64, "dim_ordering": "tf", "activation": "linear", "W_constraint": null, "bias": true, "activity_regularizer": null, "subsample": [1, 1], "name": "convolution2d_5", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "nb_col": 3, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_regularizer": null, "activation": "linear", "output_dim": 100, "bias": true, "input_dim": null, "activity_regularizer": null, "name": "dense_1", "W_regularizer": null, "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_regularizer": null, "activation": "linear", "output_dim": 50, "bias": true, "input_dim": null, "activity_regularizer": null, "name": "dense_2", "W_regularizer": null, "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_regularizer": null, "activation": "linear", "output_dim": 10, "bias": true, "input_dim": null, "activity_regularizer": null, "name": "dense_3", "W_regularizer": null, "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_regularizer": null, "activation": "linear", "output_dim": 1, "bias": true, "input_dim": null, "activity_regularizer": null, "name": "dense_4", "W_regularizer": null, "b_constraint": null, "W_constraint": null}}]}