{"class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"batch_input_shape": [null, 80, 320, 3], "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_1", "trainable": true, "epsilon": 0.001, "input_dtype": "float32", "axis": -1}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "subsample": [2, 2], "name": "convolution2d_1", "border_mode": "valid", "activation": "linear", "bias": true, "nb_col": 5, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "nb_filter": 24, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "subsample": [2, 2], "name": "convolution2d_2", "border_mode": "valid", "activation": "linear", "bias": true, "nb_col": 5, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "nb_filter": 36, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "subsample": [2, 2], "name": "convolution2d_3", "border_mode": "valid", "activation": "linear", "bias": true, "nb_col": 5, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "nb_filter": 48, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_4", "border_mode": "valid", "activation": "linear", "bias": true, "nb_col": 3, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_5", "border_mode": "valid", "activation": "linear", "bias": true, "nb_col": 3, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 100, "init": "glorot_uniform", "name": "dense_1", "activation": "linear", "bias": true, "b_constraint": null, "input_dim": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 50, "init": "glorot_uniform", "name": "dense_2", "activation": "linear", "bias": true, "b_constraint": null, "input_dim": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 10, "init": "glorot_uniform", "name": "dense_3", "activation": "linear", "bias": true, "b_constraint": null, "input_dim": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "name": "dense_4", "activation": "linear", "bias": true, "b_constraint": null, "input_dim": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "b_regularizer": null}}], "keras_version": "1.1.2"}