{"config": [{"config": {"batch_input_shape": [null, 40, 160, 3], "trainable": true, "input_dtype": "float32", "axis": -1, "momentum": 0.99, "name": "batchnormalization_1", "mode": 0, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"dim_ordering": "tf", "b_constraint": null, "trainable": true, "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null, "nb_filter": 24, "W_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "name": "convolution2d_1", "bias": true, "activation": "relu", "W_regularizer": null, "nb_row": 4, "nb_col": 4}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.4}, "class_name": "Dropout"}, {"config": {"dim_ordering": "tf", "b_constraint": null, "trainable": true, "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null, "nb_filter": 36, "W_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "name": "convolution2d_2", "bias": true, "activation": "relu", "W_regularizer": null, "nb_row": 4, "nb_col": 4}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "b_constraint": null, "trainable": true, "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null, "nb_filter": 48, "W_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "name": "convolution2d_3", "bias": true, "activation": "relu", "W_regularizer": null, "nb_row": 4, "nb_col": 4}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "b_constraint": null, "trainable": true, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "nb_filter": 64, "W_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "name": "convolution2d_4", "bias": true, "activation": "relu", "W_regularizer": null, "nb_row": 2, "nb_col": 2}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "b_constraint": null, "trainable": true, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "nb_filter": 64, "W_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "name": "convolution2d_5", "bias": true, "activation": "relu", "W_regularizer": null, "nb_row": 2, "nb_col": 2}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "bias": true, "name": "dense_1", "output_dim": 100, "input_dim": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.4}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "bias": true, "name": "dense_2", "output_dim": 50, "input_dim": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "bias": true, "name": "dense_3", "output_dim": 10, "input_dim": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "tanh", "init": "glorot_uniform", "bias": true, "name": "dense_4", "output_dim": 1, "input_dim": null, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}