{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "mode": 0, "batch_input_shape": [null, 80, 320, 3], "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "input_dtype": "float32", "axis": -1, "gamma_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "subsample": [2, 2], "nb_filter": 24, "dim_ordering": "tf", "bias": true, "name": "convolution2d_1", "nb_row": 5, "border_mode": "valid", "trainable": true, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "subsample": [2, 2], "nb_filter": 36, "dim_ordering": "tf", "bias": true, "name": "convolution2d_2", "nb_row": 5, "border_mode": "valid", "trainable": true, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "subsample": [2, 2], "nb_filter": 48, "dim_ordering": "tf", "bias": true, "name": "convolution2d_3", "nb_row": 5, "border_mode": "valid", "trainable": true, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "dim_ordering": "tf", "bias": true, "name": "convolution2d_4", "nb_row": 3, "border_mode": "valid", "trainable": true, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "dim_ordering": "tf", "bias": true, "name": "convolution2d_5", "nb_row": 3, "border_mode": "valid", "trainable": true, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "output_dim": 100, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "name": "dense_1", "trainable": true, "W_regularizer": null, "activation": "linear", "input_dim": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "output_dim": 50, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "name": "dense_2", "trainable": true, "W_regularizer": null, "activation": "linear", "input_dim": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "output_dim": 10, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "name": "dense_3", "trainable": true, "W_regularizer": null, "activation": "linear", "input_dim": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "name": "dense_4", "trainable": true, "W_regularizer": null, "activation": "linear", "input_dim": null}}]}