{"config": [{"config": {"trainable": true, "mode": 0, "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "input_dtype": "float32", "epsilon": 0.001, "batch_input_shape": [null, 80, 320, 3], "name": "batchnormalization_1"}, "class_name": "BatchNormalization"}, {"config": {"border_mode": "valid", "bias": true, "trainable": true, "nb_filter": 24, "W_constraint": null, "name": "convolution2d_1", "nb_col": 5, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "bias": true, "trainable": true, "nb_filter": 36, "W_constraint": null, "name": "convolution2d_2", "nb_col": 5, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "bias": true, "trainable": true, "nb_filter": 48, "W_constraint": null, "name": "convolution2d_3", "nb_col": 5, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "bias": true, "trainable": true, "nb_filter": 64, "W_constraint": null, "name": "convolution2d_4", "nb_col": 3, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "bias": true, "trainable": true, "nb_filter": 64, "W_constraint": null, "name": "convolution2d_5", "nb_col": 3, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "name": "dense_1", "output_dim": 100, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "name": "dense_2", "output_dim": 50, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "name": "dense_3", "output_dim": 10, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "name": "dense_4", "output_dim": 1, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}