{"keras_version": "1.1.2", "config": [{"config": {"batch_input_shape": [null, 80, 320, 3], "mode": 0, "epsilon": 0.001, "name": "batchnormalization_1", "input_dtype": "float32", "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "beta_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"nb_filter": 24, "nb_col": 5, "init": "glorot_uniform", "trainable": true, "subsample": [2, 2], "bias": true, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 36, "nb_col": 5, "init": "glorot_uniform", "trainable": true, "subsample": [2, 2], "bias": true, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 48, "nb_col": 5, "init": "glorot_uniform", "trainable": true, "subsample": [2, 2], "bias": true, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "bias": true, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "bias": true, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "trainable": true, "output_dim": 100, "bias": true, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "input_dim": null, "name": "dense_1", "activity_regularizer": null, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "trainable": true, "output_dim": 50, "bias": true, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "input_dim": null, "name": "dense_2", "activity_regularizer": null, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "trainable": true, "output_dim": 10, "bias": true, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "input_dim": null, "name": "dense_3", "activity_regularizer": null, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "trainable": true, "output_dim": 1, "bias": true, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "input_dim": null, "name": "dense_4", "activity_regularizer": null, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}