{"keras_version": "1.1.2", "config": [{"config": {"nb_filter": 24, "bias": true, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_1", "init": "glorot_uniform", "activation": "relu", "b_constraint": null, "input_dtype": "float32", "nb_row": 4, "nb_col": 4, "border_mode": "valid", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "subsample": [2, 2], "batch_input_shape": [null, 40, 160, 3]}, "class_name": "Convolution2D"}, {"config": {"momentum": 0.99, "mode": 0, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batchnormalization_1", "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"nb_filter": 36, "bias": true, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_2", "init": "glorot_uniform", "activation": "relu", "b_constraint": null, "nb_row": 4, "nb_col": 4, "border_mode": "valid", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 48, "bias": true, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_3", "init": "glorot_uniform", "activation": "relu", "b_constraint": null, "nb_row": 4, "nb_col": 4, "border_mode": "valid", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "bias": true, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_4", "init": "glorot_uniform", "activation": "relu", "b_constraint": null, "nb_row": 2, "nb_col": 2, "border_mode": "valid", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "bias": true, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_5", "init": "glorot_uniform", "activation": "relu", "b_constraint": null, "nb_row": 2, "nb_col": 2, "border_mode": "valid", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "output_dim": 100, "W_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "activation": "relu", "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"b_constraint": null, "output_dim": 50, "W_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "activation": "relu", "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"b_constraint": null, "output_dim": 10, "W_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "activation": "relu", "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"b_constraint": null, "output_dim": 1, "W_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "activation": "tanh", "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}