{"config": [{"config": {"beta_regularizer": null, "name": "batchnormalization_1", "gamma_regularizer": null, "axis": -1, "batch_input_shape": [null, 80, 320, 3], "momentum": 0.99, "mode": 0, "epsilon": 0.001, "trainable": true, "input_dtype": "float32"}, "class_name": "BatchNormalization"}, {"config": {"name": "convolution2d_1", "W_regularizer": null, "activity_regularizer": null, "nb_col": 5, "b_constraint": null, "W_constraint": null, "nb_filter": 24, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "dim_ordering": "tf", "subsample": [2, 2], "nb_row": 5, "trainable": true, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_2", "W_regularizer": null, "activity_regularizer": null, "nb_col": 5, "b_constraint": null, "W_constraint": null, "nb_filter": 36, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "dim_ordering": "tf", "subsample": [2, 2], "nb_row": 5, "trainable": true, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_3", "W_regularizer": null, "activity_regularizer": null, "nb_col": 5, "b_constraint": null, "W_constraint": null, "nb_filter": 48, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "dim_ordering": "tf", "subsample": [2, 2], "nb_row": 5, "trainable": true, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_4", "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "b_constraint": null, "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 3, "trainable": true, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_5", "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "b_constraint": null, "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 3, "trainable": true, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 100, "bias": true, "input_dim": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 50, "bias": true, "input_dim": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_3", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 10, "bias": true, "input_dim": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_4", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 1, "bias": true, "input_dim": null, "trainable": true, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}