{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 4, "b_constraint": null, "nb_filter": 24, "input_dtype": "float32", "init": "glorot_uniform", "bias": true, "batch_input_shape": [null, 40, 160, 3], "name": "convolution2d_1", "activation": "relu", "trainable": true, "W_regularizer": null, "nb_row": 4, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "momentum": 0.99, "mode": 0, "axis": -1}}, {"class_name": "Convolution2D", "config": {"nb_col": 4, "b_constraint": null, "nb_filter": 36, "init": "glorot_uniform", "bias": true, "W_constraint": null, "name": "convolution2d_2", "activation": "relu", "trainable": true, "W_regularizer": null, "nb_row": 4, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 4, "b_constraint": null, "nb_filter": 48, "init": "glorot_uniform", "bias": true, "W_constraint": null, "name": "convolution2d_3", "activation": "relu", "trainable": true, "W_regularizer": null, "nb_row": 4, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 2, "b_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "bias": true, "W_constraint": null, "name": "convolution2d_4", "activation": "relu", "trainable": true, "W_regularizer": null, "nb_row": 2, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_col": 2, "b_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "bias": true, "W_constraint": null, "name": "convolution2d_5", "activation": "relu", "trainable": true, "W_regularizer": null, "nb_row": 2, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "name": "dense_1", "activation": "relu", "output_dim": 100, "trainable": true, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"input_dim": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "name": "dense_2", "activation": "relu", "output_dim": 50, "trainable": true, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"input_dim": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "name": "dense_3", "activation": "relu", "output_dim": 10, "trainable": true, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"input_dim": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "name": "dense_4", "activation": "tanh", "output_dim": 1, "trainable": true, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null}}]}