{"class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"mode": 0, "input_dtype": "float32", "trainable": true, "name": "batchnormalization_1", "batch_input_shape": [null, 40, 160, 1], "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "epsilon": 0.001}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "subsample": [2, 2], "name": "convolution2d_1", "W_constraint": null, "nb_filter": 24, "nb_row": 4, "activity_regularizer": null, "nb_col": 4, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "border_mode": "valid", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "subsample": [2, 2], "name": "convolution2d_2", "W_constraint": null, "nb_filter": 36, "nb_row": 4, "activity_regularizer": null, "nb_col": 4, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "border_mode": "valid", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "subsample": [2, 2], "name": "convolution2d_3", "W_constraint": null, "nb_filter": 48, "nb_row": 4, "activity_regularizer": null, "nb_col": 4, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "border_mode": "valid", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_4", "W_constraint": null, "nb_filter": 64, "nb_row": 2, "activity_regularizer": null, "nb_col": 2, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "border_mode": "valid", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_5", "W_constraint": null, "nb_filter": 64, "nb_row": 2, "activity_regularizer": null, "nb_col": 2, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "border_mode": "valid", "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_1", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "output_dim": 100, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_2", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "output_dim": 50, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_3", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "output_dim": 10, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_4", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "output_dim": 1, "activation": "tanh"}}], "keras_version": "1.1.2"}