{"keras_version": "1.1.2", "config": [{"config": {"mode": 0, "axis": -1, "trainable": true, "momentum": 0.99, "name": "batchnormalization_1", "beta_regularizer": null, "batch_input_shape": [null, 80, 320, 3], "input_dtype": "float32", "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"nb_filter": 24, "trainable": true, "nb_col": 5, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "nb_row": 5, "bias": true, "activity_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "activation": "linear", "border_mode": "valid", "name": "convolution2d_1", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 36, "trainable": true, "nb_col": 5, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "nb_row": 5, "bias": true, "activity_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "activation": "linear", "border_mode": "valid", "name": "convolution2d_2", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 48, "trainable": true, "nb_col": 5, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "nb_row": 5, "bias": true, "activity_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "activation": "linear", "border_mode": "valid", "name": "convolution2d_3", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "trainable": true, "nb_col": 3, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "nb_row": 3, "bias": true, "activity_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "activation": "linear", "border_mode": "valid", "name": "convolution2d_4", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "trainable": true, "nb_col": 3, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "nb_row": 3, "bias": true, "activity_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "activation": "linear", "border_mode": "valid", "name": "convolution2d_5", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "output_dim": 100, "W_regularizer": null, "input_dim": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null, "name": "dense_1", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "output_dim": 50, "W_regularizer": null, "input_dim": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null, "name": "dense_2", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "output_dim": 10, "W_regularizer": null, "input_dim": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null, "name": "dense_3", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "output_dim": 1, "W_regularizer": null, "input_dim": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null, "name": "dense_4", "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential"}