{"config": [{"config": {"input_dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "batch_input_shape": [null, 80, 320, 3], "axis": -1, "mode": 0, "gamma_regularizer": null, "name": "batchnormalization_1", "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"nb_col": 5, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "trainable": true, "activation": "linear", "nb_filter": 24, "subsample": [2, 2], "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_1", "b_constraint": null, "nb_row": 5, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "trainable": true, "activation": "linear", "nb_filter": 36, "subsample": [2, 2], "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_2", "b_constraint": null, "nb_row": 5, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "trainable": true, "activation": "linear", "nb_filter": 48, "subsample": [2, 2], "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_3", "b_constraint": null, "nb_row": 5, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "trainable": true, "activation": "linear", "nb_filter": 64, "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_4", "b_constraint": null, "nb_row": 3, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "trainable": true, "activation": "linear", "nb_filter": 64, "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_5", "b_constraint": null, "nb_row": 3, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": null, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 100, "bias": true, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"input_dim": null, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 50, "bias": true, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"input_dim": null, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 10, "bias": true, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"input_dim": null, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1, "bias": true, "name": "dense_4"}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}