{"config": [{"config": {"input_dtype": "float32", "gamma_regularizer": null, "trainable": true, "mode": 0, "name": "batchnormalization_1", "batch_input_shape": [null, 160, 320, 3], "epsilon": 0.001, "axis": -1, "momentum": 0.99, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"nb_col": 5, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "border_mode": "valid", "init": "glorot_uniform", "W_constraint": null, "subsample": [2, 2], "nb_filter": 24, "activity_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "name": "convolution2d_1", "b_regularizer": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "border_mode": "valid", "init": "glorot_uniform", "W_constraint": null, "subsample": [2, 2], "nb_filter": 36, "activity_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "name": "convolution2d_2", "b_regularizer": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "border_mode": "valid", "init": "glorot_uniform", "W_constraint": null, "subsample": [2, 2], "nb_filter": 48, "activity_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "name": "convolution2d_3", "b_regularizer": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "border_mode": "valid", "init": "glorot_uniform", "W_constraint": null, "subsample": [1, 1], "nb_filter": 64, "activity_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "name": "convolution2d_4", "b_regularizer": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "border_mode": "valid", "init": "glorot_uniform", "W_constraint": null, "subsample": [1, 1], "nb_filter": 64, "activity_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "name": "convolution2d_5", "b_regularizer": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "bias": true, "trainable": true, "b_constraint": null, "output_dim": 100, "name": "dense_1", "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "bias": true, "trainable": true, "b_constraint": null, "output_dim": 50, "name": "dense_2", "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "bias": true, "trainable": true, "b_constraint": null, "output_dim": 10, "name": "dense_3", "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "bias": true, "trainable": true, "b_constraint": null, "output_dim": 1, "name": "dense_4", "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}