{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "BatchNormalization", "config": {"mode": 0, "gamma_regularizer": null, "input_dtype": "float32", "name": "batchnormalization_1", "trainable": true, "momentum": 0.99, "epsilon": 0.001, "axis": -1, "beta_regularizer": null, "batch_input_shape": [null, 80, 320, 3]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "b_regularizer": null, "trainable": true, "nb_col": 5, "W_constraint": null, "bias": true, "activation": "linear", "name": "convolution2d_1", "init": "glorot_uniform", "subsample": [2, 2], "W_regularizer": null, "nb_row": 5, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 24}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "b_regularizer": null, "trainable": true, "nb_col": 5, "W_constraint": null, "bias": true, "activation": "linear", "name": "convolution2d_2", "init": "glorot_uniform", "subsample": [2, 2], "W_regularizer": null, "nb_row": 5, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 36}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "b_regularizer": null, "trainable": true, "nb_col": 5, "W_constraint": null, "bias": true, "activation": "linear", "name": "convolution2d_3", "init": "glorot_uniform", "subsample": [2, 2], "W_regularizer": null, "nb_row": 5, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 48}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "b_regularizer": null, "trainable": true, "nb_col": 3, "W_constraint": null, "bias": true, "activation": "linear", "name": "convolution2d_4", "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 64}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "b_regularizer": null, "trainable": true, "nb_col": 3, "W_constraint": null, "bias": true, "activation": "linear", "name": "convolution2d_5", "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 64}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dim": null, "b_regularizer": null, "trainable": true, "W_regularizer": null, "output_dim": 100, "W_constraint": null, "bias": true, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dim": null, "b_regularizer": null, "trainable": true, "W_regularizer": null, "output_dim": 50, "W_constraint": null, "bias": true, "activation": "linear", "name": "dense_2", "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dim": null, "b_regularizer": null, "trainable": true, "W_regularizer": null, "output_dim": 10, "W_constraint": null, "bias": true, "activation": "linear", "name": "dense_3", "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dim": null, "b_regularizer": null, "trainable": true, "W_regularizer": null, "output_dim": 1, "W_constraint": null, "bias": true, "activation": "linear", "name": "dense_4", "activity_regularizer": null, "init": "glorot_uniform"}}]}