{"keras_version": "1.1.2", "config": [{"config": {"name": "batchnormalization_1", "mode": 0, "momentum": 0.99, "epsilon": 0.001, "input_dtype": "float32", "trainable": true, "beta_regularizer": null, "batch_input_shape": [null, 80, 320, 3], "axis": -1, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"W_regularizer": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_1", "activation": "linear", "nb_col": 5, "subsample": [2, 2], "nb_filter": 24, "init": "glorot_uniform", "border_mode": "valid", "dim_ordering": "tf", "nb_row": 5, "W_constraint": null, "b_constraint": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_2", "activation": "linear", "nb_col": 5, "subsample": [2, 2], "nb_filter": 36, "init": "glorot_uniform", "border_mode": "valid", "dim_ordering": "tf", "nb_row": 5, "W_constraint": null, "b_constraint": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_3", "activation": "linear", "nb_col": 5, "subsample": [2, 2], "nb_filter": 48, "init": "glorot_uniform", "border_mode": "valid", "dim_ordering": "tf", "nb_row": 5, "W_constraint": null, "b_constraint": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_4", "activation": "linear", "nb_col": 3, "subsample": [1, 1], "nb_filter": 64, "init": "glorot_uniform", "border_mode": "valid", "dim_ordering": "tf", "nb_row": 3, "W_constraint": null, "b_constraint": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_5", "activation": "linear", "nb_col": 3, "subsample": [1, 1], "nb_filter": 64, "init": "glorot_uniform", "border_mode": "valid", "dim_ordering": "tf", "nb_row": 3, "W_constraint": null, "b_constraint": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "name": "dense_1", "activation": "linear", "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "output_dim": 100, "b_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "name": "dense_2", "activation": "linear", "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "output_dim": 50, "b_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "name": "dense_3", "activation": "linear", "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "output_dim": 10, "b_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "name": "dense_4", "activation": "linear", "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "output_dim": 1, "b_constraint": null, "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}