{"keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "name": "convolution2d_1", "b_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "bias": true, "dim_ordering": "tf", "nb_col": 4, "trainable": true, "activation": "linear", "nb_filter": 24, "batch_input_shape": [null, 40, 160, 1], "border_mode": "valid", "nb_row": 4, "input_dtype": "float32", "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "name": "convolution2d_2", "b_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_col": 4, "trainable": true, "activation": "linear", "nb_filter": 36, "border_mode": "valid", "bias": true, "nb_row": 4, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "name": "convolution2d_3", "b_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_col": 4, "trainable": true, "activation": "linear", "nb_filter": 48, "border_mode": "valid", "bias": true, "nb_row": 4, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "name": "convolution2d_4", "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_col": 2, "trainable": true, "activation": "linear", "nb_filter": 64, "border_mode": "valid", "bias": true, "nb_row": 2, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "name": "convolution2d_5", "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_col": 2, "trainable": true, "activation": "linear", "nb_filter": 64, "border_mode": "valid", "bias": true, "nb_row": 2, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_1", "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 100, "trainable": true, "activation": "linear", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_2", "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 50, "trainable": true, "activation": "linear", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_3", "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 10, "trainable": true, "activation": "linear", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_4", "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1, "trainable": true, "activation": "linear", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": null}}], "class_name": "Sequential"}