{"keras_version": "1.1.2", "config": [{"config": {"name": "batchnormalization_1", "beta_regularizer": null, "momentum": 0.99, "mode": 0, "input_dtype": "float32", "epsilon": 0.001, "gamma_regularizer": null, "batch_input_shape": [null, 40, 160, 3], "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"b_regularizer": null, "name": "convolution2d_1", "dim_ordering": "tf", "W_regularizer": null, "bias": true, "border_mode": "valid", "nb_col": 4, "trainable": true, "activity_regularizer": null, "activation": "relu", "nb_filter": 24, "nb_row": 4, "W_constraint": null, "init": "glorot_uniform", "subsample": [2, 2], "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "name": "convolution2d_2", "dim_ordering": "tf", "W_regularizer": null, "bias": true, "border_mode": "valid", "nb_col": 4, "trainable": true, "activity_regularizer": null, "activation": "relu", "nb_filter": 36, "nb_row": 4, "W_constraint": null, "init": "glorot_uniform", "subsample": [2, 2], "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "name": "convolution2d_3", "dim_ordering": "tf", "W_regularizer": null, "bias": true, "border_mode": "valid", "nb_col": 4, "trainable": true, "activity_regularizer": null, "activation": "relu", "nb_filter": 48, "nb_row": 4, "W_constraint": null, "init": "glorot_uniform", "subsample": [2, 2], "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "name": "convolution2d_4", "dim_ordering": "tf", "W_regularizer": null, "bias": true, "border_mode": "valid", "nb_col": 2, "trainable": true, "activity_regularizer": null, "activation": "relu", "nb_filter": 64, "nb_row": 2, "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "name": "convolution2d_5", "dim_ordering": "tf", "W_regularizer": null, "bias": true, "border_mode": "valid", "nb_col": 2, "trainable": true, "activity_regularizer": null, "activation": "relu", "nb_filter": 64, "nb_row": 2, "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "name": "dense_1", "W_regularizer": null, "bias": true, "output_dim": 100, "trainable": true, "input_dim": null, "activity_regularizer": null, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "name": "dense_2", "W_regularizer": null, "bias": true, "output_dim": 50, "trainable": true, "input_dim": null, "activity_regularizer": null, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "name": "dense_3", "W_regularizer": null, "bias": true, "output_dim": 10, "trainable": true, "input_dim": null, "activity_regularizer": null, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "name": "dense_4", "W_regularizer": null, "bias": true, "output_dim": 1, "trainable": true, "input_dim": null, "activity_regularizer": null, "activation": "tanh", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}