{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "name": "batchnormalization_1", "batch_input_shape": [null, 40, 160, 1], "axis": -1, "input_dtype": "float32", "mode": 0, "beta_regularizer": null, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_1", "nb_row": 4, "dim_ordering": "tf", "nb_filter": 24, "nb_col": 4, "border_mode": "valid", "subsample": [2, 2], "W_regularizer": null, "W_constraint": null, "activation": "relu", "trainable": true, "bias": true, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_2", "nb_row": 4, "dim_ordering": "tf", "nb_filter": 36, "nb_col": 4, "border_mode": "valid", "subsample": [2, 2], "W_regularizer": null, "W_constraint": null, "activation": "relu", "trainable": true, "bias": true, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_3", "nb_row": 4, "dim_ordering": "tf", "nb_filter": 48, "nb_col": 4, "border_mode": "valid", "subsample": [2, 2], "W_regularizer": null, "W_constraint": null, "activation": "relu", "trainable": true, "bias": true, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_4", "nb_row": 2, "dim_ordering": "tf", "nb_filter": 64, "nb_col": 2, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "activation": "relu", "trainable": true, "bias": true, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_5", "nb_row": 2, "dim_ordering": "tf", "nb_filter": 64, "nb_col": 2, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "activation": "relu", "trainable": true, "bias": true, "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_1", "output_dim": 100, "W_constraint": null, "W_regularizer": null, "activation": "relu", "input_dim": null, "init": "glorot_uniform", "trainable": true, "bias": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_2", "output_dim": 50, "W_constraint": null, "W_regularizer": null, "activation": "relu", "input_dim": null, "init": "glorot_uniform", "trainable": true, "bias": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_3", "output_dim": 10, "W_constraint": null, "W_regularizer": null, "activation": "relu", "input_dim": null, "init": "glorot_uniform", "trainable": true, "bias": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_4", "output_dim": 1, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "input_dim": null, "init": "glorot_uniform", "trainable": true, "bias": true}}]}