{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "BatchNormalization", "config": {"trainable": true, "batch_input_shape": [null, 40, 160, 3], "axis": -1, "beta_regularizer": null, "name": "batchnormalization_1", "momentum": 0.99, "input_dtype": "float32", "gamma_regularizer": null, "mode": 0, "epsilon": 0.001}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 4, "b_regularizer": null, "W_constraint": null, "bias": true, "subsample": [2, 2], "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_1", "W_regularizer": null, "nb_filter": 24, "nb_row": 4}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 4, "b_regularizer": null, "W_constraint": null, "bias": true, "subsample": [2, 2], "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "W_regularizer": null, "nb_filter": 36, "nb_row": 4}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 4, "b_regularizer": null, "W_constraint": null, "bias": true, "subsample": [2, 2], "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_3", "W_regularizer": null, "nb_filter": 48, "nb_row": 4}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 2, "b_regularizer": null, "W_constraint": null, "bias": true, "subsample": [1, 1], "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "W_regularizer": null, "nb_filter": 64, "nb_row": 2}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 2, "b_regularizer": null, "W_constraint": null, "bias": true, "subsample": [1, 1], "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_5", "W_regularizer": null, "nb_filter": 64, "nb_row": 2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 100, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "name": "dense_1", "W_regularizer": null, "bias": true, "input_dim": null}}, {"class_name": "Dense", "config": {"output_dim": 50, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "name": "dense_2", "W_regularizer": null, "bias": true, "input_dim": null}}, {"class_name": "Dense", "config": {"output_dim": 10, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "name": "dense_3", "W_regularizer": null, "bias": true, "input_dim": null}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "tanh", "activity_regularizer": null, "b_regularizer": null, "name": "dense_4", "W_regularizer": null, "bias": true, "input_dim": null}}]}