{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"input_dtype": "float32", "mode": 0, "batch_input_shape": [null, 80, 320, 3], "name": "batchnormalization_1", "momentum": 0.99, "axis": -1, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "W_regularizer": null, "name": "convolution2d_1", "activation": "linear", "nb_row": 5, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 24, "nb_col": 5, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "W_regularizer": null, "name": "convolution2d_2", "activation": "linear", "nb_row": 5, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 36, "nb_col": 5, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "W_regularizer": null, "name": "convolution2d_3", "activation": "linear", "nb_row": 5, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 48, "nb_col": 5, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "W_regularizer": null, "name": "convolution2d_4", "activation": "linear", "nb_row": 3, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "nb_col": 3, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "W_regularizer": null, "name": "convolution2d_5", "activation": "linear", "nb_row": 3, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "nb_col": 3, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "subsample": [1, 1]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "name": "dense_1", "activity_regularizer": null, "input_dim": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "output_dim": 100}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "name": "dense_2", "activity_regularizer": null, "input_dim": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "name": "dense_3", "activity_regularizer": null, "input_dim": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "output_dim": 10}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "name": "dense_4", "activity_regularizer": null, "input_dim": null, "b_regularizer": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "output_dim": 1}}]}