{"config": [{"config": {"name": "batchnormalization_1", "trainable": true, "batch_input_shape": [null, 40, 160, 3], "input_dtype": "float32", "axis": -1, "mode": 0, "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "convolution2d_1", "trainable": true, "border_mode": "valid", "subsample": [2, 2], "b_regularizer": null, "nb_row": 4, "W_regularizer": null, "nb_col": 4, "dim_ordering": "tf", "activity_regularizer": null, "nb_filter": 24, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "bias": true, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_2", "trainable": true, "border_mode": "valid", "subsample": [2, 2], "b_regularizer": null, "nb_row": 4, "W_regularizer": null, "nb_col": 4, "dim_ordering": "tf", "activity_regularizer": null, "nb_filter": 36, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "bias": true, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"name": "convolution2d_3", "trainable": true, "border_mode": "valid", "subsample": [1, 1], "b_regularizer": null, "nb_row": 2, "W_regularizer": null, "nb_col": 2, "dim_ordering": "tf", "activity_regularizer": null, "nb_filter": 64, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "bias": true, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "trainable": true, "output_dim": 50, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "init": "glorot_uniform", "bias": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.4}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "trainable": true, "output_dim": 10, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "init": "glorot_uniform", "bias": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dense_3", "trainable": true, "output_dim": 1, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "init": "glorot_uniform", "bias": true, "activation": "tanh"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}