{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"subsample": [2, 2], "init": "glorot_uniform", "b_constraint": null, "bias": true, "nb_filter": 24, "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_1", "W_regularizer": null, "activation": "relu", "nb_row": 4, "activity_regularizer": null, "batch_input_shape": [null, 40, 160, 3], "W_constraint": null, "dim_ordering": "tf", "trainable": true, "input_dtype": "float32", "nb_col": 4}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "init": "glorot_uniform", "b_constraint": null, "bias": true, "nb_filter": 36, "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_2", "W_regularizer": null, "activation": "relu", "nb_row": 4, "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "trainable": true, "nb_col": 4}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "init": "glorot_uniform", "b_constraint": null, "bias": true, "nb_filter": 48, "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_3", "W_regularizer": null, "activation": "relu", "nb_row": 4, "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "trainable": true, "nb_col": 4}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "init": "glorot_uniform", "b_constraint": null, "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_4", "W_regularizer": null, "activation": "relu", "nb_row": 2, "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "trainable": true, "nb_col": 2}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "init": "glorot_uniform", "b_constraint": null, "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_5", "W_regularizer": null, "activation": "relu", "nb_row": 2, "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "trainable": true, "nb_col": 2}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "bias": true, "b_regularizer": null, "input_dim": null, "W_regularizer": null, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "output_dim": 100, "name": "dense_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "bias": true, "b_regularizer": null, "input_dim": null, "W_regularizer": null, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "output_dim": 50, "name": "dense_2", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "bias": true, "b_regularizer": null, "input_dim": null, "W_regularizer": null, "activation": "relu", "activity_regularizer": null, "W_constraint": null, "output_dim": 10, "name": "dense_3", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "bias": true, "b_regularizer": null, "input_dim": null, "W_regularizer": null, "activation": "tanh", "activity_regularizer": null, "W_constraint": null, "output_dim": 1, "name": "dense_4", "trainable": true}}], "keras_version": "1.1.2"}