{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "BatchNormalization", "config": {"trainable": true, "input_dtype": "float32", "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "name": "batchnormalization_1", "epsilon": 0.001, "mode": 0, "batch_input_shape": [null, 80, 320, 3]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_1", "dim_ordering": "tf", "nb_col": 5, "border_mode": "valid", "W_constraint": null, "activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_filter": 24, "nb_row": 5, "bias": true, "init": "glorot_uniform", "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_2", "dim_ordering": "tf", "nb_col": 5, "border_mode": "valid", "W_constraint": null, "activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_filter": 36, "nb_row": 5, "bias": true, "init": "glorot_uniform", "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_3", "dim_ordering": "tf", "nb_col": 5, "border_mode": "valid", "W_constraint": null, "activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_filter": 48, "nb_row": 5, "bias": true, "init": "glorot_uniform", "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_4", "dim_ordering": "tf", "nb_col": 3, "border_mode": "valid", "W_constraint": null, "activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_filter": 64, "nb_row": 3, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_5", "dim_ordering": "tf", "nb_col": 3, "border_mode": "valid", "W_constraint": null, "activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_filter": 64, "nb_row": 3, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_1", "activation": "linear", "W_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "W_constraint": null, "output_dim": 100, "b_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_2", "activation": "linear", "W_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "W_constraint": null, "output_dim": 50, "b_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_3", "activation": "linear", "W_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "W_constraint": null, "output_dim": 10, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_4", "activation": "linear", "W_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "W_constraint": null, "output_dim": 1, "b_regularizer": null}}]}