{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "trainable": true, "init": "glorot_uniform", "subsample": [2, 2], "W_regularizer": null, "activity_regularizer": null, "nb_col": 4, "nb_filter": 24, "name": "convolution2d_1", "activation": "relu", "nb_row": 4, "input_dtype": "float32", "batch_input_shape": [null, 40, 160, 3], "W_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "b_constraint": null, "bias": true}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_1", "mode": 0, "epsilon": 0.001, "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "subsample": [2, 2], "nb_filter": 36, "activity_regularizer": null, "nb_col": 4, "b_constraint": null, "name": "convolution2d_2", "activation": "relu", "nb_row": 4, "W_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "subsample": [2, 2], "nb_filter": 48, "activity_regularizer": null, "nb_col": 4, "b_constraint": null, "name": "convolution2d_3", "activation": "relu", "nb_row": 4, "W_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "activity_regularizer": null, "nb_col": 2, "b_constraint": null, "name": "convolution2d_4", "activation": "relu", "nb_row": 2, "W_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "activity_regularizer": null, "nb_col": 2, "b_constraint": null, "name": "convolution2d_5", "activation": "relu", "nb_row": 2, "W_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 100, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "name": "dense_1", "input_dim": null, "activation": "relu", "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"output_dim": 50, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "name": "dense_2", "input_dim": null, "activation": "relu", "W_constraint": null, "bias": true}}, {"class_name": "Dense", "config": {"output_dim": 10, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "name": "dense_3", "input_dim": null, "activation": "relu", "W_constraint": null, "bias": true}}, {"class_name": "Dense", "config": {"output_dim": 1, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "name": "dense_4", "input_dim": null, "activation": "tanh", "W_constraint": null, "bias": true}}], "keras_version": "1.1.2"}