{"config": [{"class_name": "BatchNormalization", "config": {"mode": 0, "epsilon": 0.001, "gamma_regularizer": null, "name": "batchnormalization_1", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "batch_input_shape": [null, 40, 160, 1], "trainable": true, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_filter": 24, "nb_row": 4, "nb_col": 4, "name": "convolution2d_1", "init": "glorot_uniform", "border_mode": "valid", "trainable": true, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_filter": 36, "nb_row": 4, "nb_col": 4, "name": "convolution2d_2", "init": "glorot_uniform", "border_mode": "valid", "trainable": true, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_filter": 48, "nb_row": 4, "nb_col": 4, "name": "convolution2d_3", "init": "glorot_uniform", "border_mode": "valid", "trainable": true, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_filter": 64, "nb_row": 2, "nb_col": 2, "name": "convolution2d_4", "init": "glorot_uniform", "border_mode": "valid", "trainable": true, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_filter": 64, "nb_row": 2, "nb_col": 2, "name": "convolution2d_5", "init": "glorot_uniform", "border_mode": "valid", "trainable": true, "b_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "bias": true, "name": "dense_1", "output_dim": 100, "init": "glorot_uniform", "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "bias": true, "name": "dense_2", "output_dim": 50, "init": "glorot_uniform", "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "bias": true, "name": "dense_3", "output_dim": 10, "init": "glorot_uniform", "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "activation": "tanh", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "bias": true, "name": "dense_4", "output_dim": 1, "init": "glorot_uniform", "trainable": true, "b_constraint": null}}], "keras_version": "1.1.2", "class_name": "Sequential"}