{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_filter": 24, "W_regularizer": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "batch_input_shape": [null, 40, 160, 3], "activation": "linear", "input_dtype": "float32", "subsample": [2, 2], "nb_row": 4, "nb_col": 4, "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_1", "bias": true, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "W_regularizer": null, "trainable": true, "nb_row": 4, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activation": "linear", "subsample": [2, 2], "nb_col": 4, "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_2", "bias": true, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "W_regularizer": null, "trainable": true, "nb_row": 4, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activation": "linear", "subsample": [2, 2], "nb_col": 4, "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_3", "bias": true, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "W_regularizer": null, "trainable": true, "nb_row": 2, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activation": "linear", "subsample": [1, 1], "nb_col": 2, "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_4", "bias": true, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "W_regularizer": null, "trainable": true, "nb_row": 2, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activation": "linear", "subsample": [1, 1], "nb_col": 2, "dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_5", "bias": true, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "bias": true, "name": "dense_1", "output_dim": 100, "input_dim": null, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "bias": true, "name": "dense_2", "output_dim": 50, "input_dim": null, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "bias": true, "name": "dense_3", "output_dim": 10, "input_dim": null, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "bias": true, "name": "dense_4", "output_dim": 1, "input_dim": null, "W_constraint": null, "activity_regularizer": null}}], "keras_version": "1.1.2"}