{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "BatchNormalization", "config": {"axis": -1, "batch_input_shape": [null, 40, 160, 1], "beta_regularizer": null, "trainable": true, "input_dtype": "float32", "gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "momentum": 0.99, "mode": 0}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "nb_filter": 24, "W_constraint": null, "border_mode": "valid", "activation": "relu", "nb_col": 4, "init": "glorot_uniform", "trainable": true, "nb_row": 4, "W_regularizer": null, "name": "convolution2d_1", "bias": true, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "nb_filter": 36, "W_constraint": null, "border_mode": "valid", "activation": "relu", "nb_col": 4, "init": "glorot_uniform", "trainable": true, "nb_row": 4, "W_regularizer": null, "name": "convolution2d_2", "bias": true, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "nb_filter": 48, "W_constraint": null, "border_mode": "valid", "activation": "relu", "nb_col": 4, "init": "glorot_uniform", "trainable": true, "nb_row": 4, "W_regularizer": null, "name": "convolution2d_3", "bias": true, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "nb_filter": 64, "W_constraint": null, "border_mode": "valid", "activation": "relu", "nb_col": 2, "init": "glorot_uniform", "trainable": true, "nb_row": 2, "W_regularizer": null, "name": "convolution2d_4", "bias": true, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "nb_filter": 64, "W_constraint": null, "border_mode": "valid", "activation": "relu", "nb_col": 2, "init": "glorot_uniform", "trainable": true, "nb_row": 2, "W_regularizer": null, "name": "convolution2d_5", "bias": true, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "W_constraint": null, "activation": "relu", "output_dim": 100, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "name": "dense_1", "bias": true, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "W_constraint": null, "activation": "relu", "output_dim": 50, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "name": "dense_2", "bias": true, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "W_constraint": null, "activation": "relu", "output_dim": 10, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "name": "dense_3", "bias": true, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "W_constraint": null, "activation": "tanh", "output_dim": 1, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "name": "dense_4", "bias": true, "b_constraint": null, "b_regularizer": null}}]}