{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "BatchNormalization", "config": {"axis": -1, "name": "batchnormalization_1", "gamma_regularizer": null, "input_dtype": "float32", "trainable": true, "momentum": 0.99, "mode": 0, "epsilon": 0.001, "beta_regularizer": null, "batch_input_shape": [null, 40, 160, 1]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "trainable": true, "name": "convolution2d_1", "subsample": [2, 2], "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "nb_col": 4, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_row": 4, "nb_filter": 24}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "trainable": true, "name": "convolution2d_2", "subsample": [2, 2], "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "nb_col": 4, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_row": 4, "nb_filter": 36}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "trainable": true, "name": "convolution2d_3", "subsample": [2, 2], "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "nb_col": 4, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_row": 4, "nb_filter": 48}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "trainable": true, "name": "convolution2d_4", "subsample": [1, 1], "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "nb_col": 2, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_row": 2, "nb_filter": 64}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "trainable": true, "name": "convolution2d_5", "subsample": [1, 1], "border_mode": "valid", "b_constraint": null, "W_regularizer": null, "nb_col": 2, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_row": 2, "nb_filter": 64}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_1", "input_dim": null, "init": "glorot_uniform", "bias": true, "trainable": true, "W_regularizer": null, "activation": "relu", "activity_regularizer": null, "output_dim": 100}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.4}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_2", "input_dim": null, "init": "glorot_uniform", "bias": true, "trainable": true, "W_regularizer": null, "activation": "relu", "activity_regularizer": null, "output_dim": 50}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_3", "input_dim": null, "init": "glorot_uniform", "bias": true, "trainable": true, "W_regularizer": null, "activation": "relu", "activity_regularizer": null, "output_dim": 10}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_4", "input_dim": null, "init": "glorot_uniform", "bias": true, "trainable": true, "W_regularizer": null, "activation": "tanh", "activity_regularizer": null, "output_dim": 1}}]}