{"keras_version": "1.1.2", "config": [{"config": {"b_constraint": null, "b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 4, "activation": "relu", "trainable": true, "nb_row": 4, "batch_input_shape": [null, 40, 160, 3], "W_constraint": null, "name": "convolution2d_1", "bias": true, "init": "glorot_uniform", "input_dtype": "float32", "subsample": [2, 2], "nb_filter": 24, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"beta_regularizer": null, "name": "batchnormalization_1", "gamma_regularizer": null, "axis": -1, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"b_constraint": null, "b_regularizer": null, "nb_filter": 36, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 4, "activation": "relu", "trainable": true, "nb_row": 4, "W_constraint": null, "name": "convolution2d_2", "bias": true, "init": "glorot_uniform", "subsample": [2, 2], "W_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "b_regularizer": null, "nb_filter": 48, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 4, "activation": "relu", "trainable": true, "nb_row": 4, "W_constraint": null, "name": "convolution2d_3", "bias": true, "init": "glorot_uniform", "subsample": [2, 2], "W_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 2, "activation": "relu", "trainable": true, "nb_row": 2, "W_constraint": null, "name": "convolution2d_4", "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 2, "activation": "relu", "trainable": true, "nb_row": 2, "W_constraint": null, "name": "convolution2d_5", "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"output_dim": 100, "b_constraint": null, "b_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "activation": "relu", "name": "dense_1", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"output_dim": 50, "b_constraint": null, "b_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "activation": "relu", "name": "dense_2", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"output_dim": 10, "b_constraint": null, "b_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "activation": "relu", "name": "dense_3", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"output_dim": 1, "b_constraint": null, "b_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "activation": "tanh", "name": "dense_4", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential"}