{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_1", "beta_regularizer": null, "momentum": 0.99, "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 40, 160, 3], "gamma_regularizer": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "border_mode": "valid", "name": "convolution2d_1", "b_constraint": null, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "bias": true, "nb_filter": 24, "nb_col": 4, "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_row": 4, "subsample": [2, 2], "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "border_mode": "valid", "name": "convolution2d_2", "b_constraint": null, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "bias": true, "nb_filter": 36, "nb_col": 4, "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_row": 4, "subsample": [2, 2], "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "border_mode": "valid", "name": "convolution2d_3", "b_constraint": null, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "bias": true, "nb_filter": 48, "nb_col": 4, "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_row": 4, "subsample": [2, 2], "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "border_mode": "valid", "name": "convolution2d_4", "b_constraint": null, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "bias": true, "nb_filter": 64, "nb_col": 2, "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_row": 2, "subsample": [1, 1], "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "border_mode": "valid", "name": "convolution2d_5", "b_constraint": null, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "bias": true, "nb_filter": 64, "nb_col": 2, "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_row": 2, "subsample": [1, 1], "W_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "b_constraint": null, "trainable": true, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "input_dim": null, "activation": "relu", "output_dim": 100, "W_constraint": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_2", "b_constraint": null, "trainable": true, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "input_dim": null, "activation": "relu", "output_dim": 50, "W_constraint": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_3", "b_constraint": null, "trainable": true, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "input_dim": null, "activation": "relu", "output_dim": 10, "W_constraint": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_4", "b_constraint": null, "trainable": true, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "input_dim": null, "activation": "tanh", "output_dim": 1, "W_constraint": null, "W_regularizer": null}}]}