{"config": [{"config": {"nb_filter": 24, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": null, "subsample": [2, 2], "b_constraint": null, "nb_row": 4, "name": "convolution2d_1", "input_dtype": "float32", "nb_col": 4, "bias": true, "trainable": true, "dim_ordering": "tf", "batch_input_shape": [null, 40, 160, 3], "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_1", "beta_regularizer": null, "axis": -1, "epsilon": 0.001, "trainable": true, "mode": 0, "momentum": 0.99, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_filter": 36, "activity_regularizer": null, "nb_col": 4, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": null, "subsample": [2, 2], "b_constraint": null, "nb_row": 4, "name": "convolution2d_2", "W_constraint": null, "bias": true, "trainable": true, "dim_ordering": "tf", "activation": "relu", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 48, "activity_regularizer": null, "nb_col": 4, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": null, "subsample": [2, 2], "b_constraint": null, "nb_row": 4, "name": "convolution2d_3", "W_constraint": null, "bias": true, "trainable": true, "dim_ordering": "tf", "activation": "relu", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "activity_regularizer": null, "nb_col": 2, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_row": 2, "name": "convolution2d_4", "W_constraint": null, "bias": true, "trainable": true, "dim_ordering": "tf", "activation": "relu", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "activity_regularizer": null, "nb_col": 2, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_row": 2, "name": "convolution2d_5", "W_constraint": null, "bias": true, "trainable": true, "dim_ordering": "tf", "activation": "relu", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "b_constraint": null, "name": "dense_1", "input_dim": null, "W_constraint": null, "output_dim": 100, "trainable": true, "activation": "relu", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "b_constraint": null, "name": "dense_2", "input_dim": null, "W_constraint": null, "output_dim": 50, "trainable": true, "activation": "relu", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "b_constraint": null, "name": "dense_3", "input_dim": null, "W_constraint": null, "output_dim": 10, "trainable": true, "activation": "relu", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "b_constraint": null, "name": "dense_4", "input_dim": null, "W_constraint": null, "output_dim": 1, "trainable": true, "activation": "tanh", "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}