{"config": [{"config": {"batch_input_shape": [null, 40, 160, 1], "axis": -1, "name": "batchnormalization_1", "momentum": 0.99, "beta_regularizer": null, "input_dtype": "float32", "trainable": true, "gamma_regularizer": null, "mode": 0, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"W_constraint": null, "nb_filter": 24, "nb_col": 4, "border_mode": "valid", "bias": true, "b_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_1", "nb_row": 4, "W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "nb_filter": 36, "nb_col": 4, "border_mode": "valid", "bias": true, "b_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_2", "nb_row": 4, "W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "nb_filter": 48, "nb_col": 4, "border_mode": "valid", "bias": true, "b_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_3", "nb_row": 4, "W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "nb_filter": 64, "nb_col": 2, "border_mode": "valid", "bias": true, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_4", "nb_row": 2, "W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "nb_filter": 64, "nb_col": 2, "border_mode": "valid", "bias": true, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_5", "nb_row": 2, "W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 100, "b_regularizer": null, "name": "dense_1", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "input_dim": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"W_constraint": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 50, "b_regularizer": null, "name": "dense_2", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "input_dim": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"W_constraint": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 10, "b_regularizer": null, "name": "dense_3", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "input_dim": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"W_constraint": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "name": "dense_4", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "input_dim": null, "activation": "tanh"}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}