{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"axis": -1, "momentum": 0.99, "batch_input_shape": [null, 80, 320, 3], "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_1", "input_dtype": "float32", "beta_regularizer": null, "epsilon": 0.001, "mode": 0}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_regularizer": null, "activation": "linear", "W_constraint": null, "bias": true, "subsample": [2, 2], "init": "glorot_uniform", "nb_col": 5, "name": "convolution2d_1", "nb_filter": 24, "b_constraint": null, "nb_row": 5, "border_mode": "valid", "b_regularizer": null, "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_regularizer": null, "activation": "linear", "W_constraint": null, "bias": true, "subsample": [2, 2], "init": "glorot_uniform", "nb_col": 5, "name": "convolution2d_2", "nb_filter": 36, "b_constraint": null, "nb_row": 5, "border_mode": "valid", "b_regularizer": null, "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_regularizer": null, "activation": "linear", "W_constraint": null, "bias": true, "subsample": [2, 2], "init": "glorot_uniform", "nb_col": 5, "name": "convolution2d_3", "nb_filter": 48, "b_constraint": null, "nb_row": 5, "border_mode": "valid", "b_regularizer": null, "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_regularizer": null, "activation": "linear", "W_constraint": null, "bias": true, "subsample": [1, 1], "init": "glorot_uniform", "nb_col": 3, "name": "convolution2d_4", "nb_filter": 64, "b_constraint": null, "nb_row": 3, "border_mode": "valid", "b_regularizer": null, "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_regularizer": null, "activation": "linear", "W_constraint": null, "bias": true, "subsample": [1, 1], "init": "glorot_uniform", "nb_col": 3, "name": "convolution2d_5", "nb_filter": 64, "b_constraint": null, "nb_row": 3, "border_mode": "valid", "b_regularizer": null, "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "W_constraint": null, "input_dim": null, "output_dim": 100, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "W_regularizer": null, "name": "dense_1", "b_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "W_constraint": null, "input_dim": null, "output_dim": 50, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "W_regularizer": null, "name": "dense_2", "b_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "W_constraint": null, "input_dim": null, "output_dim": 10, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "W_regularizer": null, "name": "dense_3", "b_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "W_constraint": null, "input_dim": null, "output_dim": 1, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "W_regularizer": null, "name": "dense_4", "b_regularizer": null, "trainable": true}}]}