{"config": [{"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batchnormalization_1", "trainable": true, "momentum": 0.99, "batch_input_shape": [null, 80, 320, 3], "gamma_regularizer": null, "mode": 0, "input_dtype": "float32", "beta_regularizer": null, "axis": -1}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "activation": "linear", "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "nb_filter": 24, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "subsample": [2, 2], "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "activation": "linear", "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "nb_filter": 36, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "subsample": [2, 2], "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "activation": "linear", "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "nb_filter": 48, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "subsample": [2, 2], "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "activation": "linear", "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "subsample": [1, 1], "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "activation": "linear", "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "subsample": [1, 1], "nb_col": 3}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "activation": "linear", "output_dim": 100, "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "activation": "linear", "output_dim": 50, "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "activation": "linear", "output_dim": 10, "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "activation": "linear", "output_dim": 1, "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null}}], "keras_version": "1.1.2", "class_name": "Sequential"}