{"class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"mode": 0, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "axis": -1, "epsilon": 0.001, "batch_input_shape": [null, 40, 160, 3], "name": "batchnormalization_1", "momentum": 0.99, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "bias": true, "dim_ordering": "tf", "activation": "relu", "init": "glorot_uniform", "subsample": [2, 2], "nb_row": 4, "border_mode": "valid", "W_constraint": null, "nb_col": 4, "trainable": true, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 24, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "bias": true, "dim_ordering": "tf", "activation": "relu", "init": "glorot_uniform", "subsample": [2, 2], "nb_row": 4, "border_mode": "valid", "W_constraint": null, "nb_col": 4, "trainable": true, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 36, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "bias": true, "dim_ordering": "tf", "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 2, "border_mode": "valid", "W_constraint": null, "nb_col": 2, "trainable": true, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 64, "W_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 50, "bias": true, "activation": "relu", "input_dim": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "name": "dense_1", "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.4, "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 10, "bias": true, "activation": "relu", "input_dim": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "name": "dense_2", "W_regularizer": null}}, {"class_name": "Dense", "config": {"output_dim": 1, "bias": true, "activation": "tanh", "input_dim": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "name": "dense_3", "W_regularizer": null}}], "keras_version": "1.1.2"}