{"config": [{"config": {"axis": -1, "trainable": true, "name": "batchnormalization_1", "momentum": 0.99, "batch_input_shape": [null, 40, 160, 3], "epsilon": 0.001, "beta_regularizer": null, "input_dtype": "float32", "gamma_regularizer": null, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"nb_row": 4, "trainable": true, "name": "convolution2d_1", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "bias": true, "subsample": [2, 2], "nb_col": 4}, "class_name": "Convolution2D"}, {"config": {"nb_row": 4, "trainable": true, "name": "convolution2d_2", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 36, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "bias": true, "subsample": [2, 2], "nb_col": 4}, "class_name": "Convolution2D"}, {"config": {"nb_row": 4, "trainable": true, "name": "convolution2d_3", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 48, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "bias": true, "subsample": [2, 2], "nb_col": 4}, "class_name": "Convolution2D"}, {"config": {"nb_row": 2, "trainable": true, "name": "convolution2d_4", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "bias": true, "subsample": [1, 1], "nb_col": 2}, "class_name": "Convolution2D"}, {"config": {"nb_row": 2, "trainable": true, "name": "convolution2d_5", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "bias": true, "subsample": [1, 1], "nb_col": 2}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dense_1", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "input_dim": null, "bias": true, "b_regularizer": null, "output_dim": 100, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dense_2", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "input_dim": null, "bias": true, "b_regularizer": null, "output_dim": 50, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dense_3", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "input_dim": null, "bias": true, "b_regularizer": null, "output_dim": 10, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dense_4", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "activation": "tanh", "init": "glorot_uniform", "input_dim": null, "bias": true, "b_regularizer": null, "output_dim": 1, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}